import re

def split_text(text: str)-> list:
    """
    Розбиття тексту на речення: Напишіть регулярний вираз, який розбиває текст на речення,
    враховуючи різні знаки пунктуації.
    """
    return re.split(r'[,.?!:;]', text)


text = "Розбиття тексту на речення: Напишіть регулярний вираз, який розбиває текст на речення, враховуючи різні знаки пунктуації."

print(split_text(text))
#  ['Розбиття тексту на речення', ' Напишіть регулярний вираз', ' який розбиває текст на речення', ' враховуючи різні знаки пунктуації', '']