import re

def find_ip_address(text_with_ips):
    """
    Пошук IP-адрес: Створіть регулярний вираз, який знаходить всі IP-адреси в тексті.
    """
    pattern = r'\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}'
    return re.findall(pattern, text_with_ips)


text = """Примечание: Все публичные серверы и сайты в сети Интернет используют "белые" IP-адреса 
(например, сайт google.com — 172.217.22.14, DNS-сервер Google — 8.8.8.8, DNS-сервер Яндекс — 77.88.8.8). 
Все публичные IP-адреса в сети Интернет уникальны и не могут повторяться."""

print(find_ip_address(text)) #  ['172.217.22.14', '8.8.8.8', '77.88.8.8']